apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sdio_dev_type.h
/**************************************************************************//**
 * @file      rtl8710c_sdio_dev_type.h
 * @brief
 * @version   V1.00
 * @date      2018-6-4 21:34:55
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 ******************************************************************************/

#ifndef _RTL8710C_SDIO_DEV_TYPE_H_
#define _RTL8710C_SDIO_DEV_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SDIO_DEV_REG_TYPE

/**
 * @addtogroup hal_sdio_dev_reg SDIO_DEV Registers.
 * @ingroup hs_hal_sdio_dev
 * @{
 */

/**
  \brief Union type to access sdio_dev_txbd_addr (@ 0x000000A0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A0) TX BD(Buffer Descriptor) Address Register                  */
  
  struct {
    __IOM uint32_t tx_bd_addr : 32;           /*!< [31..0] The base address of TXBD The value of this register
                                                   should be configure by CPU It should be 4 byte alignment
                                                   (Because TXBD Size is 8 Byte).                                            */
  } b;                                        /*!< bit fields for sdio_dev_txbd_addr */
} sdio_dev_txbd_addr_t, *psdio_dev_txbd_addr_t;

/**
  \brief Union type to access sdio_dev_txbd_num (@ 0x000000A4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A4) TX BD Number Register                                      */
  
  struct {
    __IOM uint32_t tx_bd_num  : 16;           /*!< [15..0] The Number of TXBD. Unit: Number The value of this register
                                                   should be configured at SDIO device HAL initialization                    */
  } b;                                        /*!< bit fields for sdio_dev_txbd_num */
} sdio_dev_txbd_num_t, *psdio_dev_txbd_num_t;

/**
  \brief Union type to access sdio_dev_txbd_wptr (@ 0x000000A8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000A8) TX BD Write Pointer Register                               */
  
  struct {
    __IOM uint32_t tx_bd_h2c_wptr : 16;       /*!< [15..0] When the packet has been sent from Host to TX Buffer,
                                                   this index should be updated by SDIO Device HAL driver                    */
  } b;                                        /*!< bit fields for sdio_dev_txbd_wptr */
} sdio_dev_txbd_wptr_t, *psdio_dev_txbd_wptr_t;

/**
  \brief Union type to access sdio_dev_txbd_rptr (@ 0x000000AC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000AC) TX BD Read Pointer Register                                */
  
  struct {
    __IOM uint32_t tx_bd_h2c_rptr : 16;       /*!< [15..0] When the TX packet has been processed and moved to MAC
                                                   TX FIFO, this index should be updated by HAL driver.                      */
  } b;                                        /*!< bit fields for sdio_dev_txbd_rptr */
} sdio_dev_txbd_rptr_t, *psdio_dev_txbd_rptr_t;

/**
  \brief Union type to access sdio_dev_rxbd_addr (@ 0x000000B0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000B0) RX BD Address Register                                     */
  
  struct {
    __IOM uint32_t rx_bd_addr : 32;           /*!< [31..0] The base address of RX BD. The HAL driver should configure
                                                   this register at initial. It should be a 8-Byte aligned
                                                   address.                                                                  */
  } b;                                        /*!< bit fields for sdio_dev_rxbd_addr */
} sdio_dev_rxbd_addr_t, *psdio_dev_rxbd_addr_t;

/**
  \brief Union type to access sdio_dev_rxbd_num (@ 0x000000B4).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000B4) RX BD Number Register                                      */
  
  struct {
    __IOM uint16_t rx_bd_num  : 16;           /*!< [15..0] The total number of RX BD This register should be configured
                                                   by HAL driver at initialization.                                          */
  } b;                                        /*!< bit fields for sdio_dev_rxbd_num */
} sdio_dev_rxbd_num_t, *psdio_dev_rxbd_num_t;

/**
  \brief Union type to access sdio_dev_rxbd_wptr (@ 0x000000B6).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000B6) RX BD Write Pointer Register                               */
  
  struct {
    __IOM uint16_t rx_bd_c2h_wptr : 16;       /*!< [15..0] When the packet has been processed and has been moved
                                                   to host TX FIFO, this index should be updated by the HAL
                                                   driver.                                                                   */
  } b;                                        /*!< bit fields for sdio_dev_rxbd_wptr */
} sdio_dev_rxbd_wptr_t, *psdio_dev_rxbd_wptr_t;

/**
  \brief Union type to access sdio_dev_rxbd_rptr (@ 0x000000B8).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000B8) RX BD Read Pointer Register                                */
  
