apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sdio_dev_type.h
  struct {
    __IOM uint16_t rx_bd_c2h_rptr : 16;       /*!< [15..0] When the packet has been processed and has been transfered
                                                   to host, the HW will update this RX BD index.                             */
  } b;                                        /*!< bit fields for sdio_dev_rxbd_rptr */
} sdio_dev_rxbd_rptr_t, *psdio_dev_rxbd_rptr_t;

/**
  \brief Union type to access sdio_dev_hci_rx_ctrl (@ 0x000000BA).
*/
typedef union {
  __IOM uint8_t w;                            /*!< (@ 0x000000BA) HCI RX Control Register                                    */
  
  struct {
    __IOM uint8_t rx_req      : 1;            /*!< [0..0] HAL driver triggers this bit to enable SDIO IP HW to
                                                   fetch RX BD info. SDIO HW fetch RX BD to get the RX length
                                                   and address and then start to transfer RX packet to SDIO
                                                   Host. This bit will be cleared when all RX BD transfer
                                                   is done.                                                                  */
  } b;                                        /*!< bit fields for sdio_dev_hci_rx_ctrl */
} sdio_dev_hci_rx_ctrl_t, *psdio_dev_hci_rx_ctrl_t;

/**
  \brief Union type to access sdio_dev_sdio_ctrl (@ 0x000000BB).
*/
typedef union {
  __IOM uint8_t w;                            /*!< (@ 0x000000BB) SDIO HW Control Register                                   */
  
  struct {
    __IOM uint8_t sdio_dat_edge_inv : 1;      /*!< [0..0] Set this bit to invert the SDIO data latch clock.                  */
    __IM  uint8_t             : 6;
    __IOM uint8_t sdio_dma_rst : 1;           /*!< [7..7] The HAL driver can set this bit to reset SDIO DMA HW.
                                                   This bit will be cleared automatically by the HW.                         */
  } b;                                        /*!< bit fields for sdio_dev_sdio_ctrl */
} sdio_dev_sdio_ctrl_t, *psdio_dev_sdio_ctrl_t;

/**
  \brief Union type to access sdio_dev_rx_req_addr (@ 0x000000BC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000BC) RX Request Address Register                                */
  
  struct {
    __IOM uint32_t rx_req_addr : 32;          /*!< [31..0] The address of the requested RX packet. This register
                                                   is discarded for Ameba.                                                   */
  } b;                                        /*!< bit fields for sdio_dev_rx_req_addr */
} sdio_dev_rx_req_addr_t, *psdio_dev_rx_req_addr_t;

/**
  \brief Union type to access sdio_dev_int_mask (@ 0x000000C0).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000C0) Interrupt Mask Register                                    */
  
  struct {
    __IOM uint16_t txbd_h2c_ovf : 1;          /*!< [0..0] Set this bit to enable the H2C TX BD overflow interrupt.           */
    __IOM uint16_t h2c_bus_res_fail : 1;      /*!< [1..1] Set this bit to enable the H2C bus resource failed interrupt.      */
    __IOM uint16_t h2c_dma_ok : 1;            /*!< [2..2] Set this bit to enable the H2C DMA done interrupt.                 */
    __IOM uint16_t c2h_dma_ok : 1;            /*!< [3..3] Set this bit to enable the C2H DMA done interrupt.                 */
    __IOM uint16_t h2c_msg    : 1;            /*!< [4..4] Set this bit to enable the H2C message interrupt.                  */
    __IOM uint16_t rpwm1      : 1;            /*!< [5..5] Set this bit to enable the RPWM interrupt.                         */
    __IOM uint16_t rpwm2      : 1;            /*!< [6..6] Set this bit to enable the RPWM2 interrupt.                        */
    __IOM uint16_t sdio_rst_cmd : 1;          /*!< [7..7] Set this bit to enable the SDIO reset command interrupt            */
    __IOM uint16_t rx_bd_err  : 1;            /*!< [8..8] Set this bit to enable the RX BD error interrupt.                  */
    __IOM uint16_t rx_bd_avai : 1;            /*!< [9..9] Set this bit to enable the RX BD available interrupt.              */
    __IOM uint16_t host_wake  : 1;            /*!< [10..10] Set this bit to enable the SDIO host wake event interrupt.       */
    __IOM uint16_t host_cmd11 : 1;            /*!< [11..11] Set this bit to enable the SDIO host CMD11(3.3v ->
                                                   1.8v) interrupt.                                                          */
  } b;                                        /*!< bit fields for sdio_dev_int_mask */
} sdio_dev_int_mask_t, *psdio_dev_int_mask_t;

/**
  \brief Union type to access sdio_dev_int_sts (@ 0x000000C2).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000C2) Interrupt Status Register                                  */
  
  struct {
    __IOM uint16_t txbd_h2c_ovf : 1;          /*!< [0..0] If there is not enough TX_BD for TX Packet, this interrupt
                                                   will be raised. The HAL driver write 1 to this bit to clear
                                                   this interript status.                                                    */
    __IOM uint16_t h2c_bus_res_fail : 1;      /*!< [1..1] If SDIO is going to move packet to TX FIFO and fails
                                                   to get bus resource, this interrupt raise. HAL driver write
                                                   1 to this bit to clear this interrupt status.                             */
    __IOM uint16_t h2c_dma_ok : 1;            /*!< [2..2] Trigger by SDIO HW for the event of packet is sent from
                                                   Host to TXFIFO                                                            */
    __IOM uint16_t c2h_dma_ok : 1;            /*!< [3..3] Trigger by SDIO HW for the event of packet is sent from
                                                   RXFIFO to Host                                                            */
    __IOM uint16_t h2c_msg    : 1;            /*!< [4..4] Trigger by SDIO HW for the event of H2C_MSG_INT occurs(REG_SDIO_H2C_MSG
                                                   is written)                                                               */
    __IOM uint16_t rpwm1      : 1;            /*!< [5..5] Trigger by SDIO HW for the event of the RPWM1 occurs(HRPWM2
                                                   is written) CPU should be able to receive this interrupt
                                                   even CPU clock is gated; therefore, this interrupt should
                                                   be connected to System On circuit.                                        */
    __IOM uint16_t rpwm2      : 1;            /*!< [6..6] Trigger by SDIO HW for the event of RPWM2 occurs (HRPWM
                                                   is toggled) CPU should be able to receive this interrupt
                                                   even CPU clock is gated; therefore, this interrupt should
                                                   be connected to System On circuit.                                        */
    __IOM uint16_t sdio_rst_cmd : 1;          /*!< [7..7] Trigger by SDIO HW when SDIO is reset. CPU should be
                                                   able to receive this interrupt even CPU clock is gated;
                                                   therefore, this interrupt should be connected to System
                                                   On circuit.                                                               */
    __IOM uint16_t rx_bd_err  : 1;            /*!< [8..8] Trigger by SDIO to CPU when detect RX_BD error                     */
    __IOM uint16_t rx_bd_avai : 1;            /*!< [9..9] If the free RXBD Number become larger than FREE_RXBD_COUNT(0xD8),
                                                   trigger this interrupt. This interrupt trigger only once
                                                   when free RXBD number cross FREE_RXBD_COUNT                               */
    __IOM uint16_t host_wake  : 1;            /*!< [10..10] When Host Send TRX CMD53 while CPU is not ready (SYSTEM_CPU_RDY_IND=0
                                                   or CPU_RDY_IND=0), trigger this interrupt to wake CPU,
                                                   and then indicate BUSY status to host. CPU should be able
                                                   to receive this interrupt even CPU clock is gated; therefore,
                                                   this interrupt should be connected to System On circuit.                  */
    __IOM uint16_t host_cmd11 : 1;            /*!< [11..11] When Host sends CMD11 to notify that the signal voltage
                                                   level is going to switch to 1.8v, the HW should issue this
                                                   interrupt to notify the local CPU to do the LDO power voltage
                                                   level switch.                                                             */
  } b;                                        /*!< bit fields for sdio_dev_int_sts */
} sdio_dev_int_sts_t, *psdio_dev_int_sts_t;

/**
  \brief Union type to access sdio_dev_ccpwm (@ 0x000000C4).
*/
typedef union {
  __IOM uint8_t w;                            /*!< (@ 0x000000C4) CCPWM Register (CPU domain Sync to HCPWM register)         */
  
