apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sdio_dev_type.h
  struct {
    __IM  uint8_t             : 1;
    __IOM uint8_t wlan_trx    : 1;            /*!< [1..1] 1: WLAN On; 0: WLAN Off.                                           */
    __IOM uint8_t rps_st      : 1;            /*!< [2..2] 1: AP Register Active State; 0: AP Register Sleep State;           */
    __IOM uint8_t wwlan       : 1;            /*!< [3..3] 1: Wake On WLAN State; 0: Normal State;                            */
    __IM  uint8_t             : 3;
    __IOM uint8_t toggle      : 1;            /*!< [7..7] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_ccpwm */
} sdio_dev_ccpwm_t, *psdio_dev_ccpwm_t;

/**
  \brief Union type to access sdio_dev_sys_ind (@ 0x000000C5).
*/
typedef union {
  __IOM uint8_t w;                            /*!< (@ 0x000000C5) System Indication Register                                 */
  
  struct {
    __IOM uint8_t sys_cpu_rdy_ind : 1;        /*!< [0..0] Used to indicate the SDIO NIC driver that local CPU is
                                                   ready for TRX. Default: 0 This bit is synchronized to CPU_RDY_IND(Offset
                                                   0x87)                                                                     */
  } b;                                        /*!< bit fields for sdio_dev_sys_ind */
} sdio_dev_sys_ind_t, *psdio_dev_sys_ind_t;

/**
  \brief Union type to access sdio_dev_ccpwm2 (@ 0x000000C6).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000C6) CCPWM2 Register (CPU domain Sync to HCPWM2 register)       */
  
  struct {
    __IOM uint16_t active     : 1;            /*!< [0..0] 1: indicate that the SDIO device is in the activate state.         */
    __IOM uint16_t dstandby   : 1;            /*!< [1..1] 1: indicates that the SDIO device is in the deep-standby
                                                   state.                                                                    */
    __IOM uint16_t fboot      : 1;            /*!< [2..2] 1: indicates that the SDIO device boot from the fast
                                                   boot                                                                      */
    __IOM uint16_t inic_fw_rdy : 1;           /*!< [3..3] Indicates the FW mode of the SDIO device: 1: iNIC firmware;
                                                   0: SDIO boot firmware.                                                    */
    __IM  uint16_t            : 11;
    __IOM uint16_t toggle     : 1;            /*!< [15..15] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_ccpwm2 */
} sdio_dev_ccpwm2_t, *psdio_dev_ccpwm2_t;

/**
  \brief Union type to access sdio_dev_h2c_msg (@ 0x000000C8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000C8) CPU H2C Message Register (CPU domain Sync from
                                                                  SDIO_H2C_MSG register)                                     */
  
  struct {
    __IM  uint32_t h2c_msg    : 31;           /*!< [30..0] The message from SDIO host side driver.                           */
    __IM  uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_h2c_msg */
} sdio_dev_h2c_msg_t, *psdio_dev_h2c_msg_t;

/**
  \brief Union type to access sdio_dev_c2h_msg (@ 0x000000CC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000CC) CPU C2H Message Register (CPU domain Sync to
                                                                  SDIO_C2H_MSG register)                                     */
  
  struct {
    __IOM uint32_t c2h_msg    : 31;           /*!< [30..0] The message from local HAL driver to SDIO host side
                                                   driver.                                                                   */
    __IOM uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_c2h_msg */
} sdio_dev_c2h_msg_t, *psdio_dev_c2h_msg_t;

/**
  \brief Union type to access sdio_dev_crpwm (@ 0x000000D0).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000D0) CRPWM Register (SDIO host side driver to local
                                                                  HAL driver, Sync from HRPWM register)                      */
  
  struct {
    __IM  uint16_t            : 1;
    __IM  uint16_t wlan_trx   : 1;            /*!< [1..1] 1: WLAN On; 0: WLAN Off.                                           */
    __IM  uint16_t rps_st     : 1;            /*!< [2..2] 1: AP Register Active State; 0: AP Register Sleep State;           */
    __IM  uint16_t wwlan      : 1;            /*!< [3..3] 1: Wake On WLAN State; 0: Normal State;                            */
    __IM  uint16_t            : 3;
    __IM  uint16_t toggle     : 1;            /*!< [7..7] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_crpwm */
} sdio_dev_crpwm_t, *psdio_dev_crpwm_t;

/**
  \brief Union type to access sdio_dev_crpwm2 (@ 0x000000D2).
*/
typedef union {
  __IOM uint16_t w;                           /*!< (@ 0x000000D2) CRPWM2 Register (SDIO host side driver to local
                                                                  HAL driver, Sync from HRPWM register)                      */
  
