apache/nuttx/arch/arm/src/rtl8720c/8710c/fwlib/include/rtl8710c_sdio_dev_type.h
  struct {
    __IM  uint16_t resv       : 15;           /*!< [14..0] Reserved                                                          */
    __IM  uint16_t toggle     : 1;            /*!< [15..15] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_crpwm2 */
} sdio_dev_crpwm2_t, *psdio_dev_crpwm2_t;

/**
  \brief Union type to access sdio_dev_ahb_dma_ctrl (@ 0x000000D4).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000D4) AHB DMA Control Register                                   */
  
  struct {
    __IOM uint32_t spdio_txff_wlevel : 7;     /*!< [6..0] SPDIO FIFO TX water level Range 1~126, it can be modified
                                                   only when AHB_DMA_CS = 000                                                */
    __IM  uint32_t            : 1;
    __IOM uint32_t spdio_rxff_wlevel : 7;     /*!< [14..8] SPDIO FIFO RX water level Range 1~126, it can be modified
                                                   only when AHB_DMA_CS = 000                                                */
    __IM  uint32_t            : 1;
    __IM  uint32_t ahb_dma_state : 4;         /*!< [19..16] AHB DMA state                                                    */
    __IM  uint32_t            : 1;
    __IM  uint32_t ahbm_spdio_ready : 1;      /*!< [21..21] SPDIO AHB Master HREADY signal                                   */
    __IM  uint32_t ahbm_spdio_trans : 2;      /*!< [23..22] SPDIO AHB Master HTRANS signal                                   */
    __IOM uint32_t rx_ahb_busy_wait_cnt : 4;  /*!< [27..24] When SPDIO RX transfer, AHB controller will wait BUSY
                                                   counter for AHB access target not response READY signal.
                                                   If timeout, AHB controller will issue AHB_BUS_RES_FAIL
                                                   INT to CPU.                                                               */
    __IOM uint32_t ahb_burst_type : 3;        /*!< [30..28] This field is used to control to SPDIO AHB support
                                                   Burst type. 3'b100: Support Burst 16 DW 3'b010: Support
                                                   Burst 8 DW 3'b001: Support Burst 4 DW Default is 3'b111,
                                                   all support.                                                              */
    __IOM uint32_t dispatch_txagg_pkt : 1;    /*!< [31..31] Enable SPDIO to dispatch the Aggregated TX packet.               */
  } b;                                        /*!< bit fields for sdio_dev_ahb_dma_ctrl */
} sdio_dev_ahb_dma_ctrl_t, *psdio_dev_ahb_dma_ctrl_t;

/**
  \brief Union type to access sdio_dev_free_rxbd_cnt (@ 0x000000D8).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000D8) Free RX BD Count Register                                  */
  
  struct {
    __IOM uint32_t fifo_cnt   : 7;            /*!< [6..0] The SPDIO Local FIFO counter, for debug usage.                     */
    __IM  uint32_t            : 1;
    __IOM uint32_t tx_buf_unit_size : 8;      /*!< [15..8] The Size of each single TX Buffer which is addressed
                                                   by TX_BD Unit: 64Byte Ex: 0x01=>64Byte 0x10=>1024Byte                     */
    __IOM uint32_t free_rx_bd_cnt : 16;       /*!< [31..16] If SPDIO_RXBD_C2H_RPTR is updated and the free RXBD
                                                   Number is larger than FREE_RXBD_COUNT, trigger RX_BD_AVAI_INT
                                                   interrupt.                                                                */
  } b;                                        /*!< bit fields for sdio_dev_free_rxbd_cnt */
} sdio_dev_free_rxbd_cnt_t, *psdio_dev_free_rxbd_cnt_t;

/**
  \brief Union type to access sdio_dev_h2c_msg_ext (@ 0x000000DC).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000DC) CPU H2C Extension Message Register (CPU domain
                                                                  Sync from SDIO_H2C_MSG_EXT register)                       */
  
  struct {
    __IM  uint32_t h2c_msg_ext : 31;          /*!< [30..0] The message from SDIO host side driver to the local
                                                   HAL driver.                                                               */
    __IM  uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_h2c_msg_ext */
} sdio_dev_h2c_msg_ext_t, *psdio_dev_h2c_msg_ext_t;

/**
  \brief Union type to access sdio_dev_c2h_msg_ext (@ 0x000000E0).
*/
typedef union {
  __IOM uint32_t w;                           /*!< (@ 0x000000E0) CPU C2H Extension Message Register (CPU domain
                                                                  Sync to SDIO_C2H_MSG_EXT register)                         */
  
  struct {
    __IOM uint32_t c2h_msg_ext : 31;          /*!< [30..0] The message from local HAL driver to SDIO host side
                                                   driver.                                                                   */
    __IOM uint32_t toggle     : 1;            /*!< [31..31] Toggling Bit: this is the one bit sequence number field.
                                                   Interrupt is issued when this bit is changed from 1 to
                                                   0 or from 0 to 1.                                                         */
  } b;                                        /*!< bit fields for sdio_dev_c2h_msg_ext */
} sdio_dev_c2h_msg_ext_t, *psdio_dev_c2h_msg_ext_t;

/** @} */ /* End of group ls_hal_sdio_dev_reg */
/// @endcond /* End of condition DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_SDIO_DEV_REG_TYPE */


#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8710C_SDIO_DEV_TYPE_H_

